# Pandas Files

In [1]:
import pandas as pd
pd.__version__

'1.0.3'

<hr>

## Reading in Tabular Data
- Using locally saved *chipotle.tsv* dataset (tabular)
- **skiprows=None** and **skipfooter=None** can be used to skin rows in the begining and at the end if needed

In [2]:
# Supply default arguments (names=None, because column names are provided in the header)
df = pd.read_table('Data/chipotle.tsv', sep="\t", header="infer", names=None)
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

<hr>

## Attrubutes and Methods
- Dataframe's methods end with parentheses
- Attributes do not end with parentheses

In [3]:
df = pd.read_table('Data/chipotle.tsv')

### Methods:

In [4]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [5]:
# describe method, shows statistics for numeric Columns
df.describe().transpose()

           count        mean         std  min     25%    50%     75%     max
order_id  4622.0  927.254868  528.890796  1.0  477.25  926.0  1393.0  1834.0
quantity  4622.0    1.075725    0.410186  1.0    1.00    1.0     1.0    15.0

In [6]:
# To show statistics for non numerical columns, specify "object" for include parameter
df.describe(include=['object']).transpose()

                   count unique           top freq
item_name           4622     50  Chicken Bowl  726
choice_description  3376   1043   [Diet Coke]  134
item_price          4622     78        $8.75   730

### Attributes:

In [7]:
# Look at the shape of the dataframe
df.shape

(4622, 5)

In [8]:
# Look at Column types
df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

<hr>

## Select a pandas Series from a DataFrame
- Using locally saved *ufo.csv* dataset

In [9]:
# Can use read_csv or read_table with sep="," argument
df = pd.read_csv('Data/ufo.csv')
df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [10]:
# Select the City Series (column) using a bracket notation
city = df['City']
city.head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [11]:
# Select the City Series (column) using a dot notation (pandas turns City column into a dataframe attribute)
# Dot notation does not work with spaces
city = df.City
city.head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

---

## Create a new Dataframe Column
- Create a new pandas Series, then add it to the dataframe

In [12]:
# Use a bracket notation to add a new Column
df['Location'] = df.City + ", " + df.State
df.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

<hr>

## Read File Options
- Using locaaly saved *ufo.csv* file

#### Reading only selected Columns

In [13]:
# Provide the names of columns when known
df = pd.read_csv('Data/ufo.csv', usecols=['City', 'State'])
df.head()

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [14]:
# Provide position of columns when names are not known
df = pd.read_csv('Data/ufo.csv', usecols=[0,4])
df.head()

                   City             Time
0                Ithaca   6/1/1930 22:00
1           Willingboro  6/30/1930 20:00
2               Holyoke  2/15/1931 14:00
3               Abilene   6/1/1931 13:00
4  New York Worlds Fair  4/18/1933 19:00

#### Read only selected number of Rows

In [15]:
# Read in the first 4 rows
df = pd.read_csv('Data/ufo.csv', usecols=['City', 'State'], nrows=4)
df

          City State
0       Ithaca    NY
1  Willingboro    NJ
2      Holyoke    CO
3      Abilene    KS

---